package com.inner;

/*		이너 클래스, 내부 클래스, 중첩클래스 (동일한 내용 같은말임)
 * 			- 이너클래스 : 클래스 내에 또 다른 클래스가 정의되는 것을 의미한다. 
 * 							 이런 내부 클래스가 필요한 이유 
 * 								- 하나의 멤버(필드, 메소드) 처럼 사용할 수 있기 때문임. 
 * 			- 주의 사항 및 장점
 * 				- 내부 클래스는 외부클래스의 모든 멤버들을 마치 자신의 멤버처럼 사용할 수 있다.
 * 				- static 내부클래스를 제외하고는 다른 내부클래스는 항상 외부 클래스를 통해야 
 * 				   객체 생성이 가능하다. 
 * 				   객체생성방법 : 외부 클래스 $ 내부 클래스 .class로 만들어짐.
 * 		
 * 
 * 			내부 클래스의 종류 
 * 				멤버 클래스 
 * 					- 외부클래스의 멤버변수 위치에 선언하며, 외부클래스의 인스턴스 멤버처럼 다루어진다.
 * 					   외부클래스의 인스턴스멤버들과 관련된 작업에 사용할 목적으로 선언된다.
 * 
 * 				static 클래스
 * 					- 외부클래스의 멤버 변수위치에 선언하며, 외부클래스의 static 멤버처럼 다루어진다.
 * 					   외부클래스의 static 멤버, 특히 static 메소드에서 사용할 목적으로 선언된다.
 *  
 * 				로컬(지역) 클래스
 * 					-  외부클래스의 메소드나 초기화 블럭 안에 선언하며, 선언된 영역 내부에서만 사용할 수 있다.
 * 
 * 				익명 클래스 
 *					- 클래스의 선언과 객체의 생성을 동시에 하는 이름없는 클래스. 
 */

/*		1. 멤버 클래스
 * 			 객체를 생성해야만 사용할 수 있는 멤버들과 같은 위치에 정의되는 클래스 
 * 			 내부클래스를 생성하려면 외부클래스의 객체를 생성한 후에 생성할 수 있다.
 * 			
 * 			class Outer {
 * 				class Inner {
 * 					
 * 				}
 * 			}
 *
 * 			객체생성
 * 				Outer.Inner in = new Outer().new Inner();
 * 
 * 			Outer o = new Outer();
 * 			o.Inner in = o.new Inner();
 * 
 */

class OuterEx {

	class InnerEx {
		int x = 5;
	}

}

public class InnerEx01 {

	public static void main(String[] args) {
		// 외부 클래스의 객체를 먼저 생성.
		OuterEx o = new OuterEx();
		OuterEx.InnerEx oi = o.new InnerEx();
		System.out.println(oi.x);
	}

}
