package com.classex;

/*		클래스의 정의 : 객체를 정의해 놓은 것이다.	
 * 		클래스의 용도 : 객체를 생성하는 사용한다.
 * 
 * 		객체의 정의 :	실제로 존재하는 것을 객체라고 한다.
 * 		객체의 용도 :	객체가 가지고 있는 속성과 기능에 따라 다르다.
 * 
 *  	객체의 종류 
 *  		유형의 객체 : 책상, 의자, 컴퓨터, 자동차 ...
 *  		무형의 객체 : 논리식, 수학공식, 과학의 원리 ...
 *
 * 		객체를 사용한다는 것은 객체가 가지고 있는 속성과 기능을 사용한다.
 * 		
 * 		객체 -> 클래스로 만들어지는 것
 * 		인스턴스 -> 객체를 만드는 과정을 클래스의 인스턴스화 
 * 					-> 만들어진 객체를 클래스의 인스턴스
 * 
 * 			클래스 --------------> 인스턴스(객체)
 * 				인스턴스화 : 클래스로부터 객체가 만들어지는 과정
 * 			
 * 			클래스의 구성 요소 
 * 				속성 : 멤버필드, 특성, 필드, 상태
 * 				기능 : 메소드, 함수, 행위 
 * 
 */

public class Tv {
		/* 	속성 : 크기, 길이, 높이, 색상, 채널, 볼륨 -> 멤버필드(변수)
		 * 		기능 : 켜기, 끄기, 볼륨 업(다운), 채널변경 -> 멤버 메소드
		 */	
		
		// 멤버필드(멤버 변수)
		String color ; // 필드
		boolean power; 
		int channel;
		
		//멤버 메소드(함수)
		void power() { power = !power;}
		void channelUp() {channel++;}
		void channelDown() {channel--;}
		
		
		
		
		
		
		
}
