package com.forExam;

/*	
 * 		반복문 : 어떤 작업이 반복적으로 수행되도록할 때 사용한다. 
 * 				for, while(do while)문 
 * 
 * 			for 문의 형식 	
 * 				for(초기값; 조건식 ; 증감값) {
 * 						반복 수행할 문장;
 * 				}
 * 
 * 				{}은 반복 수행할 문장이 하나이면 생략 가능하다.
 * 
 * 				초기값 : 반복문에 사용될 변수를 초기화 하는 부분이며, 처음 한번만 수행한다.
 * 						  가장 먼저 한번 수행됨
 * 				조건식 : 초기값 다음으로 수행되고 반복수행할때 마다 한번씩 비교하여
 * 						  반복을 수행할 것인지를 결정한다.
 * 						  조건이 (true)이면 계속 반복, (false)이면 반복을 중단한다.
 * 				증감식 : 변수의 값을 증가(++)또는 감소(--) 시키는 연산자
 * 						   반복 수행할때마다 조건식에 비교하기전에 항상 수행되며, 
 * 						   변수값을 증가 또는 감소시켜 원활하게 반복문을 수행하도록 함.
 */


public class ForEx01 {

	public static void main(String[] args) {
		
		int i;
		
		for(i=1; i<=5; i++) {// 초기값을 1로하고 종료값이 5가 될때까지 하나씩 증가.
			//조건이 참일 때 수행하는 문장.
			System.out.println(i);
		}
		
		for(i=1; i<=5; i++) {
			System.out.print(i+" ");
		}
		
	}

}
